#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьИнструменты(Инструменты) Экспорт
	МассивПараметров = Новый Массив;
	
	// Добавляем параметры
	МассивПараметров.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"input_text", "string", "Наименование товара", , Истина));
	
	// Создаем схему
	СхемаПараметров = mcp_Метаданные.СхемаПараметровИнструмента(МассивПараметров);
	
	// Добавляем инструмент
	mcp_Метаданные.ДобавитьИнструмент(
		Инструменты, "price_of_goods", "Закупочные цены товаров", СхемаПараметров);
КонецПроцедуры

Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы) Экспорт
	Если ИмяИнструмента = "price_of_goods" Тогда
		Результат = JSONЗапрос_ЦеныТоваров_СрезПоследних_ПоНаименованиюТовара(Аргументы.input_text);
		Возврат Результат;
	КонецЕсли;
	
	ВызватьИсключение "Неизвестный инструмент: " + ИмяИнструмента;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает данные первой записи результата запроса в виде структуры.
// 
// Параметры:
//  РезультатЗапроса - РезультатЗапроса - Результат запроса, содержащий данные для обработки.
// 
// Возвращаемое значение:
//  Структура - структура с результатом.
//
Функция РезультатЗапросаВСоответствие(Знач РезультатЗапроса)
	
	Результат = Новый Соответствие;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
КонецФункции

Функция JSONЗапрос_ЦеныТоваров_СрезПоследних_ПоНаименованиюТовара(НаименованиеТовара)

	ТекстЗапроса = "ВЫБРАТЬ
				   |	ПРЕДСТАВЛЕНИЕ(ЦеныНоменклатурыСрезПоследних.Номенклатура) КАК Товар,
				   |	ПРЕДСТАВЛЕНИЕ(ЦеныНоменклатурыСрезПоследних.ВидЦены) КАК ВидЦен,
				   |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
				   |ИЗ
				   |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура.Наименование ПОДОБНО &НаименованиеТовара) КАК
				   |		ЦеныНоменклатурыСрезПоследних";

	Запрос = Новый Запрос(ТекстЗапроса);
	УсловиеНаименованиеТовара = СтрШаблон("%%%1%%", НаименованиеТовара);
	Запрос.УстановитьПараметр("НаименованиеТовара", УсловиеНаименованиеТовара);
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураРезультата = РезультатЗапросаВСоответствие(РезультатЗапроса);
	МассивСтруктур = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтруктура = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(СтруктураРезультата));
		НоваяСтруктура.Вставить("Товар", Выборка.Товар);
		НоваяСтруктура.Вставить("ВидЦен", Выборка.ВидЦен);
		НоваяСтруктура.Вставить("Цена", Выборка.Цена);
		МассивСтруктур.Добавить(НоваяСтруктура);
	КонецЦикла;

	Возврат mcp_ОбщегоНазначения.СтруктураВJSON(МассивСтруктур);

КонецФункции
 	 
#КонецОбласти

#КонецЕсли
